Suoudkhan2701/STM32_Mavlink/main.cpp
	float float_value = initial_position.x;
	uint8_t tx_buffer[sizeof(float)];
	memcpy(tx_buffer, &float_value, sizeof(float));

	float float_value1 = initial_position.y;
	uint8_t tx_buffer1[sizeof(float)];
	memcpy(tx_buffer1, &float_value1, sizeof(float));

	float float_value2 = initial_position.z;
	uint8_t tx_buffer2[sizeof(float)];
	memcpy(tx_buffer2, &float_value2, sizeof(float));

	float float_value3 = initial_position.yaw;
	uint8_t tx_buffer3[sizeof(float)];
	memcpy(tx_buffer3, &float_value3, sizeof(float));

	//HAL_UART_Transmit(&hlpuart1, (uint8_t*)("INITIAL POSITION XYZ:"), 100, HAL_MAX_DELAY);
	//HAL_UART_Transmit(&hlpuart1, tx_buffer, sizeof(float), HAL_MAX_DELAY);
	//HAL_UART_Transmit(&hlpuart1, tx_buffer1, sizeof(float), HAL_MAX_DELAY);
	//HAL_UART_Transmit(&hlpuart1, tx_buffer2, sizeof(float), HAL_MAX_DELAY);
	//HAL_UART_Transmit(&hlpuart1, tx_buffer3, sizeof(float), HAL_MAX_DELAY);
//	printf("INITIAL POSITION XYZ = [ %.4f , %.4f , %.4f ] \n", initial_position.x, initial_position.y, initial_position.z);
//	printf("INITIAL POSITION YAW = %.4f \n", initial_position.yaw);
	//HAL_UART_Transmit(&hlpuart1, &totransmit1, 1, HAL_MAX_DELAY);
	//HAL_UART_Transmit(&hlpuart1, (uint8_t*)("Commands Entered"),100, HAL_MAX_DELAY);
}

void Commands(Autopilot_Interface &api, bool autotakeoff)
{
	//HAL_UART_Transmit(&hlpuart1, (uint8_t*)("Commands Entered"),100, HAL_MAX_DELAY);
	api.enable_offboard_control();
	//usleep(100);
	if(autotakeoff)
	{
		api.arm_disarm(true);
		//HAL_Delay(10);
	}
	//HAL_UART_Transmit(&hlpuart1, (uint8_t*)("Send Offboard Commands\n"),100, HAL_MAX_DELAY);
	mavlink_set_position_target_local_ned_t sp;
	mavlink_set_position_target_local_ned_t ip = api.initial_position;
	api.set_position(ip.x, ip.y, ip.z, sp);

	api.set_yaw((ip.yaw + 90.0/180.0*M_PI), sp);
	if(autotakeoff)
	{
		sp.type_mask |= MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_TAKEOFF;
	}
	api.update_setpoint(sp);
	while (true)
	{
		mavlink_local_position_ned_t pos = api.current_messages.local_position_ned;
//		printf("CURRENT POSITION XYZ = [ % .4f , % .4f , % .4f ] \n", pos.x, pos.y, pos.z);
//		Mavlink_Messages messages = api.current_messages;
//	    printf("Position  (NED):  %f %f %f (m)\n", pos.x, pos.y, pos.z );
//	    mavlink_attitude_t attitude = messages.attitude;
//	    mavlink_get_attitude_battery_t custom = messages.custom;
//	    mavlink_battery_status_t battery_status = messages.battery_status;
//	    custom.roll=attitude.roll;
//	    custom.pitch=attitude.pitch;
//	    custom.yaw=attitude.yaw;
//	    custom.current_battery= battery_status.current_battery;
//	    custom.energy_consumed= battery_status.energy_consumed;
//	    custom.battery_remaining= battery_status.battery_remaining;
//	    printf("Time (Since Boot):%lu \n", custom.time_boot_ms);
//        printf("Roll: %f (rad)\n", custom.roll);
//        printf("Yaw: %f (rad)\n", custom.yaw);
//        printf("Pitch: %f (rad)\n", custom.pitch);
//        printf("Current Battery: %d (cA)\n",custom.current_battery);
//        printf("Energy Consumed: %d (hJ)\n",custom.energy_consumed);
//        printf("Battery Remaining: %d (%)\n",custom.battery_remaining);
//        printf("\n");
	    //HAL_Delay(100);
	}
	api.arm_disarm(false);
}

void Autopilot_Interface::write_thread(void)
{
	//writing_status = 2;
	mavlink_set_position_target_local_ned_t sp;
	sp.type_mask = (MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_VELOCITY & MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_YAW_RATE & MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_ROLL & MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_PITCH);
	sp.coordinate_frame = MAV_FRAME_LOCAL_NED;
	sp.vx       = 0.0;
	sp.vy       = 0.0;
	sp.vz       = 0.0;
	sp.yaw_rate = 0.0;
	current_setpoint.data = sp;
	Autopilot_Interface::write_setpoint();
	bool writing_status = true;
	while ( !time_to_exit )
	{
		//usleep(250000);   // Stream at 4Hz
		HAL_Delay(10);
		Autopilot_Interface::write_setpoint();
		time_to_exit=true;
	}
	writing_status = false;
	return;
}

int Autopilot_Interface::write_message(mavlink_message_t &message)
{
	char buf[MAVLINK_MAX_PACKET_LEN];
	unsigned len = mavlink_msg_to_send_buffer((uint8_t*)buf, &message);
	HAL_UART_Transmit(&huart1, (uint8_t *)&buf, len, HAL_MAX_DELAY);
//	HAL_UART_Transmit(&hlpuart1, (uint8_t *)&buf, len, HAL_MAX_DELAY);
//	uint8_t totransmit1[] = {'q'};
//	HAL_UART_Transmit(&hlpuart1, totransmit1, 1, HAL_MAX_DELAY);
//	uint8_t totransmit1[]={'r'};
//					HAL_UART_Transmit(&hlpuart1, totransmit1, 1, HAL_MAX_DELAY);
	return len;
}
void Autopilot_Interface::write_setpoint()
{
	mavlink_set_position_target_local_ned_t sp;
	sp = current_setpoint.data;
	if ( not sp.time_boot_ms)
	    sp.time_boot_ms = (uint32_t) (get_time_usec()/1000);
	sp.target_system    = system_id;
	sp.target_component = autopilot_id;
	mavlink_message_t message;
	mavlink_msg_set_position_target_local_ned_encode(system_id, companion_id, &message, &sp);
	int len = Autopilot_Interface::write_message(message);
	//return len;
}

void Autopilot_Interface::enable_offboard_control()
{
	if ( control_status == false )
	{
		HAL_UART_Transmit(&hlpuart1, (uint8_t*)("ENABLE OFFBOARD MODE"), 20, HAL_MAX_DELAY);
		//printf("ENABLE OFFBOARD MODE\n");
		int success = Autopilot_Interface::toggle_offboard_control( true );
		if ( success )
			control_status = true;
		else
		{
			HAL_UART_Transmit(&hlpuart1, (uint8_t*)(stderr), 100, HAL_MAX_DELAY);
			HAL_UART_Transmit(&hlpuart1, (uint8_t*)("Error: off-board mode not set, could not write message\n"),53 , HAL_MAX_DELAY);
			//fprintf(stderr,"Error: off-board mode not set, could not write message\n");
		}
		printf("\n");
	}
}
void Autopilot_Interface::disable_offboard_control()
{
    if ( control_status == true )
	{
		printf("DISABLE OFFBOARD MODE\n");
		int success = Autopilot_Interface::toggle_offboard_control( false );
		if ( success )
			control_status = false;
		else
		{
			fprintf(stderr,"Error: off-board mode not set, could not write message\n");
		}
		printf("\n");
	}
	else
	{
		printf("Cannot Enter");
	}

