Suoudkhan2701/STM32_Mavlink/main.cpp
}
int Autopilot_Interface::arm_disarm( bool flag )
{
	if(flag)
	{
		HAL_UART_Transmit(&hlpuart1, (uint8_t*)("ARM MOTORS"), 10, HAL_MAX_DELAY);
		//printf("ARM ROTORS\n");
	}
	else
	{
		HAL_UART_Transmit(&hlpuart1, (uint8_t*)("DISARM MOTORS"), 10, HAL_MAX_DELAY);
		//printf("DISARM ROTORS\n");
	}
	mavlink_command_long_t com = { 0 };
	com.target_system    = system_id;
	com.target_component = autopilot_id;
	com.command          = MAV_CMD_COMPONENT_ARM_DISARM;
	com.confirmation     = true;
	com.param1           = (float) flag;
	com.param2           = 21196;
	mavlink_message_t message;
	mavlink_msg_command_long_encode(system_id, companion_id, &message, &com);
    int len = Autopilot_Interface::write_message(message);
    return len;
}
int Autopilot_Interface::move_control(uint16_t x, uint16_t y, uint16_t z, uint16_t r, uint16_t buttons, bool flag)
{
	if(flag)
	{
		printf("MANUAL CONTROL ENABLED\n");
		mavlink_command_long_t com = {0};
	    com.target_system    = system_id;
	    com.target_component = autopilot_id;
	    com.command          = MAV_CMD_DO_SET_MODE;
	    com.confirmation     = true;
	    com.param1           = autopilot_id;
	    com.param2           = x;
	    com.param3           = y;
	    com.param4           = z;
		com.param5           = r;
	    com.param6           = buttons;
	    mavlink_message_t message;
	    mavlink_msg_command_long_encode(system_id, companion_id, &message, &com);
        int len = Autopilot_Interface::write_message(message);
        return len;
	}
	else
	{
		return 0;
	}
}
int Autopilot_Interface::toggle_offboard_control( bool flag )
{
	mavlink_command_long_t com = { 0 };
	com.target_system    = system_id;
	com.target_component = autopilot_id;
	com.command          = MAV_CMD_NAV_GUIDED_ENABLE;
	com.confirmation     = true;
	com.param1           = (float) flag; // flag >0.5 => start, <0.5 => stop
	mavlink_message_t message;
	mavlink_msg_command_long_encode(system_id, companion_id, &message, &com);
    int len = Autopilot_Interface::write_message(message);
    return len;
}
void Autopilot_Interface::update_setpoint(mavlink_set_position_target_local_ned_t setpoint)
{
	//std::lock_guard<std::mutex> lock(current_setpoint.mutex);
	current_setpoint.data = setpoint;
}









void Autopilot_Interface::read_thread()
{
	reading_status = false;
//	const char* str = reading_status ? "True" : "False";
//	HAL_UART_Transmit(&hlpuart1, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);

	while (!reading_status)
	{
//		uint8_t totransmit1[] = {'q'};
//		HAL_UART_Transmit(&hlpuart1, totransmit1, 1, HAL_MAX_DELAY);
		Autopilot_Interface::read_messages();
		HAL_Delay(100); // Read batches at 10Hz
		//time_to_exit=true;
		reading_status = true;
	}
	return;
}


int Autopilot_Interface::read_message(mavlink_message_t &message)
{
	    uint8_t receive_buffer[MAVLINK_MAX_PACKET_LEN];
		mavlink_status_t status;
		uint8_t msgReceived = false;
//		uint8_t rx_buffer[1000];
//		HAL_UART_Receive(&huart1,rx_buffer,8,HAL_MAX_DELAY);
//		for (int i=0; i<1000; i++)
//		{
//			HAL_UART_Transmit(&hlpuart1, &rx_buffer[i], 1, HAL_MAX_DELAY);
//		}
	    //uint8_t rx_buffer;
		int bytesReceived=HAL_UART_Receive(&huart1,receive_buffer,sizeof(receive_buffer),HAL_MAX_DELAY);
//		HAL_UART_Receive_IT(&huart1, cp, sizeof(cp));
		//HAL_UART_Transmit(&hlpuart1, cp, 1000, HAL_MAX_DELAY);
//		    // Data received successfully, proceed to transmit
//		    uint8_t totransmit1[] = {'q'};
//		    HAL_UART_Transmit(&hlpuart1, totransmit1, 1, HAL_MAX_DELAY);
//		} else {
//			HAL_UART_Transmit(&hlpuart1, (uint8_t*)("Error"), 8, HAL_MAX_DELAY);

		uint8_t totransmit1[] = {'q'};
		HAL_UART_Transmit(&hlpuart1, totransmit1, 1, HAL_MAX_DELAY);
		//int result = _read_port(cp);
//		msgReceived = mavlink_parse_char(MAVLINK_COMM_1, receive_buffer, &message, &status);
		for (int i = 0; i < MAVLINK_MAX_PACKET_LEN; i++)
		    {
		        msgReceived = mavlink_parse_char(MAVLINK_COMM_1, receive_buffer[i], &message, &status);
		        if (msgReceived)
		        {
		            break;  // Exit loop if a message is successfully parsed
		        }
		    }
		const char* str = msgReceived ? "True" : "False";
		HAL_UART_Transmit(&hlpuart1, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
		//HAL_UART_Transmit(&hlpuart1, &(msgReceived), 10, HAL_MAX_DELAY);
		if ( (lastStatus.packet_rx_drop_count != status.packet_rx_drop_count) && debug )
		{
			//HAL_UART_Transmit(&hlpuart1, (uint8_t*)"Error: DROPPED PACKETS", 23, HAL_MAX_DELAY);
			//HAL_UART_Transmit(&hlpuart1, (uint8_t*)(status.packet_rx_drop_count), 20, HAL_MAX_DELAY);
		}
			lastStatus = status;
		if(msgReceived && debug)
		{
			// Report info
			//HAL_UART_Transmit(&hlpuart1, (uint8_t*)"Received message from serial with ID", 36, HAL_MAX_DELAY);
			//HAL_UART_Transmit(&hlpuart1, (uint8_t*)(message.msgid), 20, HAL_MAX_DELAY);
			//HAL_UART_Transmit(&hlpuart1, (uint8_t*)(message.sysid), 20, HAL_MAX_DELAY);
			//HAL_UART_Transmit(&hlpuart1, (uint8_t*)(message.compid), 20, HAL_MAX_DELAY);

			//fprintf(stderr,"Received serial data: ");
			unsigned int i;
			uint8_t buffer[MAVLINK_MAX_PACKET_LEN];
			unsigned int messageLength = mavlink_msg_to_send_buffer(buffer, &message);
			if (messageLength > MAVLINK_MAX_PACKET_LEN)
			{
				//HAL_UART_Transmit(&hlpuart1, (uint8_t*)"FATAL ERROR: MESSAGE LENGTH IS LARGER THAN BUFFER SIZE", 54, HAL_MAX_DELAY);
			}
			else
			{
				for (i=0; i<messageLength; i++)
				{
					unsigned char v=buffer[i];
					HAL_UART_Transmit(&hlpuart1, &v, sizeof(v), HAL_MAX_DELAY);
					//fprintf(stderr,"%02x ", v);
				}
				//fprintf(stderr,"\n");
			}

		}
		return msgReceived;
}
void Autopilot_Interface::read_messages()
{
	bool success;
	bool received_all = false;
	Time_Stamps this_timestamps;
	while (!(received_all) and (!reading_status) )
	{
	    mavlink_message_t message;
//	    uint8_t rx_buffer[1000];
//	    uint8_t*cp;
//	    mavlink_status_t status;
//	    uint8_t msgReceived = false;
//	    HAL_UART_Receive(&huart1,cp,8,10000);
//	    msgReceived = mavlink_parse_char(MAVLINK_COMM_1, *cp, &message, &status);
//	    success=msgReceived;
		success = Autopilot_Interface::read_message(message);
//		const char* str = success ? "True" : "False";
//		HAL_UART_Transmit(&hlpuart1, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
	    if (success==true)
	    {
	        current_messages.sysid  = message.sysid;
	        current_messages.compid = message.compid;
	        switch (message.msgid)
			{
				case MAVLINK_MSG_ID_HEARTBEAT:
				{
	                //printf("MAVLINK_MSG_ID_HEARTBEAT\n");
					mavlink_msg_heartbeat_decode(&message, &(current_messages.heartbeat));
					current_messages.time_stamps.heartbeat = get_time_usec();
					this_timestamps.heartbeat = current_messages.time_stamps.heartbeat;
					break;
				}
				case MAVLINK_MSG_ID_SYS_STATUS:
				{
	                //printf("MAVLINK_MSG_ID_SYS_STATUS\n");
					mavlink_msg_sys_status_decode(&message, &(current_messages.sys_status));
					current_messages.time_stamps.sys_status = get_time_usec();
					this_timestamps.sys_status = current_messages.time_stamps.sys_status;
					break;
	            }
				case MAVLINK_MSG_ID_BATTERY_STATUS:
				{
					//printf("MAVLINK_MSG_ID_BATTERY_STATUS\n");
					mavlink_msg_battery_status_decode(&message, &(current_messages.battery_status));
					current_messages.time_stamps.battery_status = get_time_usec();
					this_timestamps.battery_status = current_messages.time_stamps.battery_status;
					break;
				}
				case MAVLINK_MSG_ID_RADIO_STATUS:
				{
					//printf("MAVLINK_MSG_ID_RADIO_STATUS\n");
					mavlink_msg_radio_status_decode(&message, &(current_messages.radio_status));
					current_messages.time_stamps.radio_status = get_time_usec();
					this_timestamps.radio_status = current_messages.time_stamps.radio_status;
					break;
				}
				case MAVLINK_MSG_ID_LOCAL_POSITION_NED:
				{
					//printf("MAVLINK_MSG_ID_LOCAL_POSITION_NED\n");
					mavlink_msg_local_position_ned_decode(&message, &(current_messages.local_position_ned));
					current_messages.time_stamps.local_position_ned = get_time_usec();
					this_timestamps.local_position_ned = current_messages.time_stamps.local_position_ned;
					break;
				}
				case MAVLINK_MSG_ID_GLOBAL_POSITION_INT:
				{
					//printf("MAVLINK_MSG_ID_GLOBAL_POSITION_INT\n");
					mavlink_msg_global_position_int_decode(&message, &(current_messages.global_position_int));
					current_messages.time_stamps.global_position_int = get_time_usec();
					this_timestamps.global_position_int = current_messages.time_stamps.global_position_int;
					break;
				}
				case MAVLINK_MSG_ID_POSITION_TARGET_LOCAL_NED:
				{
					//printf("MAVLINK_MSG_ID_POSITION_TARGET_LOCAL_NED\n");
					mavlink_msg_position_target_local_ned_decode(&message, &(current_messages.position_target_local_ned));
					current_messages.time_stamps.position_target_local_ned = get_time_usec();
					this_timestamps.position_target_local_ned = current_messages.time_stamps.position_target_local_ned;
					break;
				}
				case MAVLINK_MSG_ID_POSITION_TARGET_GLOBAL_INT:
				{
					//printf("MAVLINK_MSG_ID_POSITION_TARGET_GLOBAL_INT\n");
					mavlink_msg_position_target_global_int_decode(&message, &(current_messages.position_target_global_int));
					current_messages.time_stamps.position_target_global_int = get_time_usec();
					this_timestamps.position_target_global_int = current_messages.time_stamps.position_target_global_int;
					break;
				}
				case MAVLINK_MSG_ID_HIGHRES_IMU:
				{
					//printf("MAVLINK_MSG_ID_HIGHRES_IMU\n");
					mavlink_msg_highres_imu_decode(&message, &(current_messages.highres_imu));
					current_messages.time_stamps.highres_imu = get_time_usec();
					this_timestamps.highres_imu = current_messages.time_stamps.highres_imu;
					break;
				}
				case MAVLINK_MSG_ID_ATTITUDE:
				{
					//printf("MAVLINK_MSG_ID_ATTITUDE\n");
					mavlink_msg_attitude_decode(&message, &(current_messages.attitude));
					current_messages.time_stamps.attitude = get_time_usec();
					this_timestamps.attitude = current_messages.time_stamps.attitude;
					break;
				}
				case MAVLINK_MSG_ID_MANUAL_CONTROL:
				{
					//printf("MAVLINK_MSG_ID_MANUAL_CONTROL\n");
					mavlink_msg_attitude_decode(&message, &(current_messages.attitude));
					current_messages.time_stamps.attitude = get_time_usec();
					this_timestamps.attitude = current_messages.time_stamps.attitude;
					break;
				}
				case MAVLINK_MSG_ID_GET_ATTITUDE_BATTERY:
				{
					//printf("MAVLINK_MSG_ID_GET_ATTITUDE_BATTERY\n");
					mavlink_msg_attitude_decode(&message, &(current_messages.attitude));
					current_messages.time_stamps.custom = get_time_usec();
					this_timestamps.custom = current_messages.time_stamps.custom;
					break;
				}
				default:
				{
					//printf("No message id %i\n",message.msgid);
					break;
				}
			}
	        HAL_UART_Transmit(&hlpuart1, (uint8_t*)this_timestamps.heartbeat, MAVLINK_MAX_PACKET_LEN, HAL_MAX_DELAY);
	        HAL_UART_Transmit(&hlpuart1, (uint8_t*)this_timestamps.sys_status, MAVLINK_MAX_PACKET_LEN, HAL_MAX_DELAY);

