Suoudkhan2701/STM32_Mavlink/main.cpp
		}
		received_all =this_timestamps.heartbeat && this_timestamps.sys_status;
	//				this_timestamps.battery_status             &&
	//				this_timestamps.radio_status               &&
	//				this_timestamps.local_position_ned         &&
	//				this_timestamps.global_position_int        &&
	//				this_timestamps.position_target_local_ned  &&
	//				this_timestamps.position_target_global_int &&
	//				this_timestamps.highres_imu                &&
	//				this_timestamps.attitude                   &&
        HAL_UART_Transmit(&hlpuart1, (uint8_t*)received_all, MAVLINK_MAX_PACKET_LEN, HAL_MAX_DELAY);

		if (writing_status > false)
	    {
	        //usleep(100); //Switches Off'
		    HAL_Delay(100);
	    }
		//HAL_UART_Transmit(&hlpuart1, (uint8_t*)("No Error"), 100, HAL_MAX_DELAY);
	}
	return;
}


uint64_t get_time_usec()
{
	static struct timeval _time_stamp;
	gettimeofday(&_time_stamp, NULL);
	return ((_time_stamp.tv_sec*1000000) +_time_stamp.tv_usec);
}

void Autopilot_Interface::set_position(float x, float y, float z, mavlink_set_position_target_local_ned_t &sp)
{
	mavlink_message_t msg;
	sp.type_mask=MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_POSITION;
	sp.coordinate_frame = MAV_FRAME_LOCAL_NED;
//	printf("Give x:");
//	scanf("%f",&x);
//	printf("Give y:");
//	scanf("%f",&y);
//	printf("Give z:");
//	scanf("%f",&z);
	x=1;
	y=1;
	z=1;
	sp.x   = x;
	sp.y   = y;
	sp.z   = z;
	//sp.r   = r;
	uint8_t tx_buffer4[sizeof(mavlink_set_position_target_local_ned_t)];
	//memcpy(tx_buffer4, &sp, sizeof(mavlink_set_position_target_local_ned_t));
    mavlink_msg_set_position_target_local_ned_encode(system_id, companion_id, &msg, &sp);
	HAL_UART_Transmit(&hlpuart1, (uint8_t*)("Current Setpoint:\n"), 100, HAL_MAX_DELAY);
	//HAL_UART_Transmit(&hlpuart1, tx_buffer4, 100, HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart1, tx_buffer4, sizeof(tx_buffer4), HAL_MAX_DELAY);
	//printf("POSITION SETPOINT XYZ = [ %.4f , %.4f , %.4f ] \n", sp.x, sp.y, sp.z);
}
//void set_velocity(float vx, float vy, float vz,mavlink_set_position_target_local_ned_t &sp)
//{
//	sp.type_mask=MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_VELOCITY;
//	sp.coordinate_frame = MAV_FRAME_LOCAL_NED;
//	sp.vx   = vx;
//	sp.vy   = vy;
//	sp.vz   = vz;
//	printf("VELOCITY SETPOINT XYZ = [ %.4f , %.4f , %.4f ] \n", sp.vx, sp.vy, sp.vz);
//}
//void set_acceleration(float ax, float ay, float az, mavlink_set_position_target_local_ned_t &sp)
//{
//	sp.type_mask=MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_ACCELERATION & MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_VELOCITY;
//	sp.coordinate_frame = MAV_FRAME_LOCAL_NED;
//	sp.afx   = ax;
//	sp.afy   = ay;
//	sp.afz   = az;
//	//printf("ACCELERATION SETPOINT XYZ = [ %.4f , %.4f , %.4f ] \n", sp.ax, sp.ay, sp.az);
//}
void Autopilot_Interface::set_yaw(float yaw, mavlink_set_position_target_local_ned_t &sp)
{
	mavlink_message_t msg;
	sp.type_mask=sp.type_mask & MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_YAW_ANGLE;
    HAL_UART_Transmit(&hlpuart1, (uint8_t*)("Give yaw:\n"), 100, HAL_MAX_DELAY);
//	printf("Give yaw:");
//	scanf("%f",&yaw);
	yaw=1;
	sp.yaw=yaw;
	uint8_t tx_buffer5[sizeof(mavlink_set_position_target_local_ned_t)];
//	memcpy(tx_buffer5, &sp, sizeof(mavlink_set_position_target_local_ned_t));
	mavlink_msg_set_position_target_local_ned_encode(system_id, companion_id, &msg, &sp);
	HAL_UART_Transmit(&hlpuart1, (uint8_t*)("POSITION SETPOINT YAW:\n"), 100, HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart1, tx_buffer5, sizeof(huart1), HAL_MAX_DELAY);
	//printf("POSITION SETPOINT YAW = %.4f\n",sp.yaw);
}

//void set_yaw_rate(float yaw_rate, mavlink_set_position_target_local_ned_t &sp)
//{
//	sp.type_mask = sp.type_mask & MAVLINK_MSG_SET_POSITION_TARGET_LOCAL_NED_YAW_RATE ;
//	sp.yaw_rate = yaw_rate;
//}


PUTCHAR_PROTOTYPE
{
  /* Place your implementation of fputc here */
  /* e.g. write a character to the USART1 and Loop until the end of transmission */
  HAL_UART_Transmit(&hlpuart1, (uint8_t *)&ch, 1, 0xFFFF);
  return ch;
}
READCHAR_PROTOTYPE
{
	uint8_t data;
	HAL_UART_Receive(&hlpuart1, &data, 1, HAL_MAX_DELAY);
	return (int)data;
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */


